// export let apiHost = 'http://kyun.yshdev.cn'; //开发环境
export let apiHost = 'https://test3.1718china.cn'; //测试环境
// export let apiHost = 'https://express.1718china.cn'; //正式环境
export let apiUrl = apiHost + '/api';
// export let feedBackApiUrl = 'http://wx.1718china.cn/api'; //测试环境
// export let imgApiUrl = 'http://wx.1718china.cn/'; //测试环境
export let feedBackApiUrl = 'https://yqcapi.1718china.net/api'; //正式环境
export let imgApiUrl = 'https://yqcapi.1718china.net/'; //正式环境

//#ifdef H5
	export let appId = 'yshkyh5';
	//export let wxappid = 'wxd0a14981b5ea4134'; //测试环境
	export let wxappid = 'wx951db03601305d9f'; //正式环境
//#endif
//#ifdef MP-WEIXIN
	export let appId = 'yshkyWechatMini';
	export let wxappid = 'wxeb078e68d7650a40';
//#endif

export let agreeContent = `
<div style="padding: 15px; font-size: 12px;line-height: 21px;text-align: justify;text-indent: 2em;">
<h2 style="font-weight: bold;text-align: center;font-size: 14px;">仪商汇仪器快运平台服务协议</h2> 
<p>本协议由您（以下简称“用户”）与“仪商汇”仪器快运平台（网址：www.1718china.cn）的运营方仪众宏鑫（北京）国际贸易有限责任公司（以下可简称为 “仪商汇”）订立。在您申请注册成为”仪商汇”仪器快运平台用户前，请您仔细阅读本协议。</p> 
<p style="font-weight: bold;color:red;padding-top: 4px;">第一条   注册协议的确认和接纳 </p>
<p>“仪商汇”仪器快运平台，指域名为 www.1718china.cn，是中国仪器仪表行业协会代理商分会指导下，由仪众宏鑫（北京）国际贸易有限责任公司所提供的网站服务，企业与企业之间利用电子市场进行贸易和交流的工具，是为用户提供账户信息管理、账户充值、物流发货、物流订单查询、支付运费等服务内容的互联网服务平台。”仪商汇”仪器快运平台与第三方支付通道“中金支付”签订合作协议，由中金支付提供资金托管、代付等功能。”仪商汇”所提供的各项服务的所有权和运营权，均归属于仪众宏鑫（北京）国际贸易有限责任公司。 </p>
<p>平台服务协议（以下简称“本协议”）系用户因使用”仪商汇”仪器快运平台的物流服务而与”仪商汇”仪器快运平台订立的协议。用户实际使用”仪商汇”或者注册为”仪商汇”仪器快运平台用户，即表示接受本协议的所有条件和条款。用户部分或全部不接受本协议条款的，不得使用”仪商汇”仪器快运平台。</p> 
<p>本协议内容同时包括”仪商汇”仪器快运平台已经发布或可能不断发布或更新的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分。</p >
<p style="font-weight: bold;color:red;padding-top: 4px;">第二条 平台服务简介</p> 
    <p>1、“仪商汇”仪器快运平台运用自己的操作系统通过国际互联网络为注册会员提供网络服务。同时，会员必须准备如下设备和承担如下开支： </p>
    <p>(1)上网设备，包括并不限于电脑或者其他上网终端、调制解调器及其他必备的上网装置；</p>
<p>(2)上网开支，包括并不限于网络接入费、上网设备租用费、手机流量费等。 </p> 
<p>2、基于”仪商汇”仪器快运平台所提供的网络服务的重要性，会员应同意：提供详尽、准确的注册资料并且不断更新注册资料，符合及时、详尽、准确的要求。如果会员提供的注册资料不合法、不真实、不准确、不详尽，会员需承担因此引起的相应责任及后果，并且”仪商汇”仪器快运平台保留终止会员使用”仪商汇”仪器快运平台各项服务的权利。 </p>
<p>3、会员在”仪商汇”仪器快运平台进行下单、充值等活动时，涉及用户真实姓名/名称、通信地址、联系电话、电子邮箱等隐私信息的，”仪商汇”仪器快运平台将予以严格保密，承诺不会在未获得会员许可的情况下擅自将会员的个人资料信息出租或出售给任何第三方，但以下情况除外：  </p>
<p>(1)会员同意让第三方共享资料；  </p> 
<p>(2)会员同意公开其个人资料，享受为其提供的产品和服务； </p>  
<p>(3)需要听从法庭传票、法律命令或遵循法律程序；  </p>  
<p>(4)”仪商汇”仪器快运平台发现会员违反了本站服务条款或本站其它使用规定。 </p> 
<p>4、会员注册成功后，将产生用户名和密码等账户信息，会员可以根据平台规定改变密码。会员应谨慎合理地保存、使用其用户名和密码。会员若发现任何非法使用其账号或存在安全漏洞的情况，请立即通知平台并向公安机关报案。若因会员个人使用和(或)保管不当造成用户名和密码泄露并因此造成损失的，”仪商汇”仪器快运平台不承担任何责任。</p> 
<p>5、会员服务的条件和规则包含于本协议以及”仪商汇”仪器快运平台网站内统一发布的服务条款、说明、通知公告、流程说明、温馨提示等规则中；请您在阅读并同意遵守本协议及网站规则后，再享受会员服务，否则由此带来的不便和责任由您自行承担。</p> 
<p>6、您同意并认可”仪商汇”仪器快运平台仪器快运平台可以通过邮件、短信、电话等形式，向您及您指定的收货人发送订单信息、促销活动等告知信息。 </p>
<p>7、会员不得将在平台注册获得的账户借给他人使用，否则会员应承担由此产生的全部责任，并与实际使用人承担连带责任。</p> 
<p>8、用户同意，”仪商汇”仪器快运平台有权使用会员的注册信息、用户名、密码等信息，登录进入用户的注册账户，进行证据保全，包括但不限于公证、见证等。</p> 
<p>9、依据国家相关法律法规规章，您同意严格遵守以下义务： </p>
<p>(1)不得传输或发表：煽动抗拒、破坏宪法和法律、行政法规实施的言论，煽动颠覆国家政权，推翻社会主义制度的言论，煽动分裂国家、破坏国家统一的言论，煽动民族仇恨、民族歧视、破坏民族团结的言论；</p>
<p>(2)从中国大陆向境外传输资料信息时必须符合中国有关法律法规；</p>
<p>(3)不得利用本网站从事洗钱、窃取商业秘密、窃取个人信息等违法犯罪活动；</p>
<p>(4)不得干扰本网站的正常运转，不得侵入本网站及国家计算机信息系统；</p>
<p>(5)不得传输或发表任何违法犯罪的、骚扰性的、中伤他人的、辱骂性的、恐吓性的、伤害性的、庸俗的、淫秽的、不文明的等信息资料；</p>
<p>(6)不得传输或发表损害国家社会公共利益和涉及国家安全的信息资料或言论；</p>
<p>(7)不得教唆他人从事本条所禁止的行为；</p> 
<p>(8)不得发布任何侵犯他人著作权、商标权等知识产权及其他合法权利的内容。”仪商汇”仪器快运平台保留删除网站内涉嫌违反本会员协议、法律法规政策及不真实的信息内容且无须通知您的权利。</p> 
<p>若您未遵守以上规定的，”仪商汇”仪器快运平台有权作出独立判断并采取暂停会员权限直至注销您的会员账户等措施，并且您须对自己的言论和行为承担法律责任。 </p>
<p style="font-weight: bold;color:red;padding-top: 4px;">第三条   信息储存与更新 </p>
<p>1、用户应在使用平台服务之前认真阅读本协议及相关业务规则内容。如对协议有任何疑问的，应向”仪商汇”仪器快运平台客服咨询。但无论用户事实上是否在使用平台服务之前认真阅读了本协议内容，只要用户使用平台服务，则本协议即对用户产生约束，届时用户不应以未阅读本协议的内容或者未获得”仪商汇”仪器快运平台客服对问询的解答等理由，主张本协议无效，或要求撤销本协议。 </p>
<p>2、用户有义务在注册时提供自己的真实资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的真实性、有效性、安全性、完整性和及时更新，以便”仪商汇”仪器快运平台为用户提供服务，并与用户进行及时、有效的联系。</p> 
<p>3、用户同意”仪商汇”仪器快运平台可以自行或通过合作的第三方机构对用户提交或”仪商汇”仪器快运平台收集的用户信息（包括但不限于用户的身份信息、财务信息、工作信息、经营信息等）进行核实，并对获得的核实结果根据相关法律法规、本协议及有关文件进行查看、使用和留存等操作。</p> 
<p>4、如因用户的资料未及时更新，导致”仪商汇”仪器快运平台服务无法提供或提供时发生任何错误，用户不得将此作为取消交易或拒绝付款的理由，”仪商汇”仪器快运平台亦不承担任何责任，所有损失或费用等不利后果应由用户自行承担。 </p>
<p>5、用户同意”仪商汇”仪器快运平台可使用关于用户的个人资料（包括但不限于”仪商汇”仪器快运平台持有的有关用户的档案中的资料，及”仪商汇”仪器快运平台从用户目前及以前在”仪商汇”仪器快运平台上的活动所获取的其他资料）以解决争议、对纠纷进行调解、确保在”仪商汇”仪器快运平台进行安全交易，并执行”仪商汇”仪器快运平台的注册协议及平台其他规则。”仪商汇”仪器快运平台有时候可能调查多个用户以识别问题或解决争议，特别是”仪商汇”仪器快运平台可审查用户的资料以区分使用多个用户名或别名的用户。为限制在网站上的欺诈、非法行为或其他刑事犯罪活动，使”仪商汇”仪器快运平台免受其害，用户同意”仪商汇”仪器快运平台可通过人工或自动程序对用户的个人资料进行审核。 </p>
<p>6、“仪商汇”仪器快运平台对于用户提供的、自行收集到的、经认证的个人信息将按照《电信和互联网服务用户个人信息保护规定》及相关法律法规、本规则及平台其他规则予以保护、使用或者披露。”仪商汇”仪器快运平台将采用行业标准惯例以保护用户的个人资料，但”仪商汇”仪器快运平台不能确保由于技术限制的原因，用户的个人资料不会通过本协议中未列明的途径泄露、盗取出去。</p> 
<p>7、“仪商汇”仪器快运平台有义务根据有关法律向司法机关、政府部门等有权机关提供用户的个人资料。在用户未能按照与本协议和业务规则或者与”仪商汇”仪器快运平台与用户签订的有关协议的约定履行自己应尽的义务时，”仪商汇”仪器快运平台有权根据自己的判断、有关协议和平台其他规则、国家生效裁决文书或者与该笔交易有关的其他用户的合理请求披露用户的个人资料（包括但不限于在”仪商汇”仪器快运平台及其他互联网络上公布用户的违法、违约行为，并将该内容记入任何与用户相关的信用资料、档案或数据库），”仪商汇”仪器快运平台对此不承担任何责任。</p> 
<p>8、如因不可抗力或”仪商汇”仪器快运平台无法控制的其他原因使”仪商汇”仪器快运平台系统崩溃或无法正常使用，从而导致交易无法完成或丢失有关的信息、记录等，”仪商汇”仪器快运平台不承担责任。”仪商汇”仪器快运平台会尽可能合理地协助处理善后事宜，并努力使用户免受或减少经济损失。</p> 
<p style="font-weight: bold;color:red;padding-top: 4px;">第四条  签约及订单 </p>
<p>1、当您在”仪商汇”仪器快运平台下单时，请您务必仔细填写各项内容，限制性要求等重要事项，并在下单时核实联系地址、电话、收货人等信息。如果因为您填写的收件人联系电话、地址等信息错误，导致物流服务产生错误，由此造成的损失需由您自行承担。 </p>
<p>2、您的使用行为应当基于真实的需求，不得存在对服务实施恶意购买、恶意维权等扰乱”仪商汇”仪器快运平台正常秩序的行为。基于维护”仪商汇”仪器快运平台交易秩序及交易安全的需要，”仪商汇”仪器快运平台发现上述情形时可主动执行关闭相关交易订单等操作。</p> 
<p>3、如您在使用过程中有任何疑问，您可以通过”仪商汇”仪器快运平台设立的客服渠道进行咨询和投诉。 </p>
<p style="font-weight: bold;color:red;padding-top: 4px;">第五条  用户行为规范 </p>
<p>1、在使用”仪商汇”仪器快运平台的服务过程中实施的所有行为均遵守国家法律、法规等规范文件，不违背社会公共利益或公共道德，不损害他人的合法权益，不违反本协议及相关规则。如果违反前述承诺，产生任何法律后果的，用户应以自己的名义独立承担所有的法律责任，并确保”仪商汇”仪器快运平台免于因此产生任何损失。 </p>
<p>2、不发布法律和法规禁止发布的信息，不发布涉嫌侵犯他人知识产权或其它合法权益的信息，不发布违背社会公共利益或公共道德、公序良俗的信息，不发布其它涉嫌违法、违反交易规则或违反本协议及各类规则的信息。 </p>
<p>3、不对”仪商汇”仪器快运平台上的任何数据或信息作商业性利用，包括但不限于在未经”仪商汇”仪器快运平台事先书面同意的情况下，以复制、传播等任何方式使用，或许可、泄露给任何第三方使用，或者为任何第三方使用提供便利，该等责任及于用户与”仪商汇”仪器快运平台服务关系终止后三年。</p> 
<p>4、不使用任何装置、软件或例行程序干预或试图干预”仪商汇”仪器快运平台的正常运作或正在”仪商汇”仪器快运平台上进行的任何活动。用户不得采取任何将导致不合理的庞大数据负载加诸”仪商汇”仪器快运平台网络设备的行动。 </p>
<p>5、不得进行危害计算机网络安全的行为，包括但不限于：使用未经许可的数据或进入未经许可的服务器帐号；不得未经允许进入公众计算机网络或者他人计算机系统并删除、修改、增加存储信息；不得未经许可，企图探查、扫描、测试本平台系统或网络的弱点或其它实施破坏网络安全的行为；不得企图干涉、破坏系统的正常运行。</p> 
<p style="font-weight: bold;color:red;padding-top: 4px;">第六条  责任范围与限制 </p>
<p>1、用户违反第4条用户行为规范时，”仪商汇”仪器快运平台有权依据平台规则，做出相应处理或终止提供服务，且无须征得用户的同意或提前通知用户，”仪商汇”仪器快运平台对此不承担任何责任。 </p>
<p>2、根据相关法令的指定或者”仪商汇”仪器快运平台业务规则的判断，用户的行为涉嫌违反法律法规的规定或违反本协议或平台已发布的相关协议条款的，”仪商汇”仪器快运平台有权采取相应措施，包括但不限于罚款、暂扣款项、直接屏蔽、删除侵权信息、降低信用值或直接停止提供服务，直至注销账户。</p> 
<p>3、用户账户被注销后，”仪商汇”仪器快运平台没有义务为其保留或向其披露其账户中的任何信息，也没有义务向用户或第三方转发任何用户未曾阅读或发送过的信息。</p> 
<p>4、用户理解并同意，与”仪商汇”仪器快运平台的协议关系终止后，”仪商汇”仪器快运平台仍享有下列权利： </p>
<p>(1)继续保存用户未及时删除的注册信息及使用服务期间发布的所有信息的权利，直至法律规定的记录保存期满；</p>
<p>(2)用户在使用服务期间存在违法行为或违反本协议和/或规则的行为的，”仪商汇”仪器快运平台仍可依据本协议向用户主张权利；</p>
<p>(3)要求用户根据本协议承担保密义务而无需支付任何费用的权利。  </p>
<p style="font-weight: bold;color:red;padding-top: 4px;">第七条  争议调解和处理 </p>
    <p>1、您在”仪商汇”仪器快运平台交易过程中发生争议的，您有权选择以下途径解决： </p>
<p>(1)协商解决；</p>
<p>(2)使用”仪商汇”仪器快运平台平台提供的争议调处服务；</p>
<p>(3)请求消费者协会或者其他依法成立的调解组织调解；</p>
<p>(4)向有关行政部门投诉；</p>
<p>(5)提请仲裁机构仲裁；</p>
<p>(6)向人民法院提起诉讼。 </p>
<p style="font-weight: bold;color:red;padding-top: 4px;">第八条 所有权及知识产权条款 </p>
<p>1、用户承诺，用户对提交或发布的任何内容负责，并且该等内容不得侵犯或违反任何其他方的权利或违反任何法律。用户一旦接受本协议，即表明该用户主动将其在任何时间段在”仪商汇”仪器快运平台发表的任何形式的信息内容的财产性权利等任何可转让的权利，如著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给”仪商汇”所有，用户同意”仪商汇”有权就任何主体侵权而单独提起诉讼。</p> 
<p>2、用户承诺，用户在使用平台服务中所提供或产生的内容侵犯第三方合法权益的，用户均应当以自己的名义独立承担所有的法律责任，并应确保”仪商汇”仪器快运平台免于承担因此产生的损失或增加的费用。“仪商汇”仪器快运平台因此遭受第三方的索赔，或受到任何行政管理部门的处罚，用户应当赔偿“仪商汇”仪器快运平台因此造成的损失及发生的费用，包括合理的律师费用。</p> 
<p>3、除非因使用平台服务而必须，未经”仪商汇”仪器快运平台明示书面许可，用户不得使用”仪商汇”仪器快运平台的商标（不论是否注册）、企业名称、商业标识、域名等，用户以不得自行或委托他人抢注或申请与”仪商汇”仪器快运平台有关的任何知识产权。 </p>
<p>4、仪众宏鑫（北京）国际贸易有限责任公司是”仪商汇”仪器快运平台的所有者,拥有此网站内容及资源的著作权等合法权利,受国家法律保护,有权不时地对本协议及平台的内容进行修改，并在平台张贴，无须另行通知用户。在法律允许的最大限度范围内，”仪商汇”对本协议及平台内容拥有解释权。</p> 
<p>5、除法律另有强制性规定外，未经”仪商汇”明确的特别书面许可,任何单位或个人不得以任何方式非法地全部或部分复制、转载、引用、链接、抓取或以其他方式使用”仪商汇”仪器快运平台的信息内容，否则，”仪商汇”有权追究其法律责任。 </p>
<p>6、”仪商汇”仪器快运平台所刊登的资料信息（诸如文字、图表、标识、按钮图标、图像、声音文件片段、数字下载、数据编辑和软件），均是”仪商汇”或其内容提供者的财产，受中国和国际版权法的保护。平台上所有内容的汇编是”仪商汇”的排他性财产，受中国和国际版权法的保护。平台上所有软件都是”仪商汇”或其关联公司或其软件供应商的财产，受中国和国际版权法的保护。 </p>
<p style="font-weight: bold;color:red;padding-top: 4px;">第九条 服务限制与终止 </p>
    <p>1、出现以下情况之一时，”仪商汇”有权对您的会员账户的部分或者全部权限或功能（包括但不限于：下单、付款、评价等）进行限制并取消与下列情况相关的尚未履行完毕的订单：</p> 
<p>(1)多次在评论区发布与所售商品无关的广告、辱骂等信息的或多次恶意进行负面评价的；</p>
<p>(2)恶意索赔、投诉，无故对商家或客服人员进行辱骂、人身攻击的；</p>  
<p>2、出现以下情况时，”仪商汇”有权直接以注销会员账户的方式终止本协议，并保留永久不允许注册的权利： </p>
<p>(1)您通过网络攻击、大量发布广告等行为影响网站正常经营或影响网站为其他会员提供服务的；</p>
<p>(2)您多次（2次及以上）利用商家的失误或”仪商汇”仪器快运平台网站的漏洞，恶意下单，谋取利益的；</p>
<p>(3)您通过外挂工具、网络攻击或其他不正当行为非法获取积分、电子券等虚拟财产的（对此”仪商汇”有权在不进行提前告知的情况下对违规账户进行冻结清算处理，并保留追究相关人员法律责任的权利）；</p>
<p>(4)您提供的用户信息（包括但不限于姓名、电话、身份证号、电子邮箱等）不真实、不准确或不完整的；</p> 
<p>(5)会员协议及网站规则变更时，您明示并通知”仪商汇”仪器快运平台不愿接受该等变更的；</p>
<p>(6)您有其他影响网站正常经营秩序或违法行为的。</p>  
<p>3、因您违反本章程的规定而导致”仪商汇”仪器快运平台、供应商或采购商损失的，您同意予以全额赔偿，赔偿范围包括但不限于律师费、诉讼费、直接损失、间接损失等。</p>  
<p style="font-weight: bold;color:red;padding-top: 4px;">第十条  其它 </p>
<p>1、本协议适用中华人民共和国大陆地区适用之有效法律。如发生本协议或网站规则与中华人民共和国法律相抵触，则这些内容将完全按法律规定重新解释，而其它条款则依旧保持对您的约束力。 </p>
<p>2、若您和”仪商汇”仪器快运平台就协议的订立和履行等事宜产生争议的，双方应尽力友好协商解决；协商不成时，任何一方均可向本平台所在地的中华人民共和国大陆地区法院提起诉讼。 </p>
</div>`;